//기분 좋을 때 응원 글귀
const quotesMood1: string[] = [
  '빛나는 당신의 내일을 응원합니다!',
  '잘해왔고 잘하고 있고 잘할거야!',
  '오늘도 힘차게 :D',
  '행복하고 즐겁고 기쁜일들만 가득할거야!',
  '아름다운 질문을 하는 사람은 언제나 아름다운 대답을 얻는다.',
  '처음의 마음으로 마지막까지',
  '오늘도 화이팅하세요!',
  '흔들리지 않는 굳은 결심. 조급하게 생각말고 나를 믿자!',
];

//기분 좋을 때 응원 글귀
const quotesMood2: string[] = [
  '오늘 하루는 어땠어, 마냥 즐거운 하루였으면 좋겠다!',
  '수고했어요 오늘도 :)',
  '마음을 비우니까 편안해졌다. 본질을 바라보게 된 것이다. 삶, 그거면 됐다.',
  '당신은 웃을 때 가장 아릅답습니다 :D',
  '더 잘할수 없어도 더 노력하는 거라면 그게 더 아름다운게 아닐까 -노력,흔글',
  '무엇을 아무리 얇게 베어낸다 해도 거기에는 언제나 양면이 있다는 것을 나는 배웠다-오마르 워싱턴, <나는 배웠다>',
];

const quotesMood3: string[] = [
  '많이 힘들었지? 괜찮아. 다 잘될거야.',
  '세상은 고통으로 가득하지만 그것을 극복하는 사람들로도 가득하다. -헬렌 켈러',
  '흔들려도 좋으니 꺾이지만 마라. -동그라미, 새삼스러운 세상',
  '달빛에 비치는 바다도 흔들릴 때 더 아름답다. 찰랑일 때 더 빛난다. 그대도 눈부시다 -흔글, 무너지지만 말아',
  '지금 이순간이 언젠가 너를 빛나게 할거야.',
  '잠깐 무너져도 돼. 어떻게 매일을 꿋꿋이 버티기만 하겠어. 억지로 버티는 고집은 너를 위태롭게 만들 뿐이야.',
  '네가 겪는 숱한 저항과 매서운 바람들은 네 잘못이 아니란다. 흔들리면서도 봉우리를 틔워줘서 고마워.',
];

const moodQuotes = [
  { moodId: 1, quotes: quotesMood1 },
  { moodId: 2, quotes: quotesMood2 },
  { moodId: 3, quotes: quotesMood3 },
];

export default moodQuotes;
